import { Grid, Typography } from '@mui/material'

export const DownloadIcon = () => {
  return (
    <>
      <Grid item width={20}>
        <svg
          id='Layer_1'
          version='1.1'
          viewBox='0 0 100 100'
          xmlns='http://www.w3.org/2000/svg'
          enable-background='new 0 0 100 100'
        >
          <path
            d='M13 86.1c-4.4 0-8-3.6-8-8v-32c0-2.2 1.8-4 4-4s4 1.8 4 4v30c0 1.1.9 2 2 2h70c1.1 0 2-.9 2-2v-30c0-2.2 1.8-4 4-4s4 1.8 4 4v32c0 4.4-3.6 8-8 8H13z'
            fill='#40f1ff'
          ></path>
          <path
            d='m54 52.2 10.1-10.1c.8-.8 2-.8 2.8 0l2.8 2.8c.8.8.8 2 0 2.8l-14 14.2c-3.1 3.1-8.2 3.1-11.3 0L30.2 47.8c-.8-.8-.8-2 0-2.8l2.8-2.8c.8-.8 2-.8 2.8 0l10.2 10V15.9c0-1.1.9-2 2-2h4c1.1 0 2 .9 2 2v36.3z'
            fill='#40f1ff'
          ></path>
        </svg>
      </Grid>
      <Typography fontSize={'10px'} fontWeight={400} sx={{ mt: 2 }} color={'white'}>
        ダウンロード
      </Typography>
    </>
  )
}

export const CompareIcon = () => {
  return (
    <>
      <Grid item width={20}>
        <svg viewBox='0 0 48 48' xmlns='http://www.w3.org/2000/svg'>
          <path
            d='M45.8 23.2c-.2.1-.4.1-.6.1-.6 0-1.1-.3-1.4-.9l-6-13.6-6 13.6c-.3.8-1.2 1.1-2 .8-.8-.3-1.1-1.2-.8-2l6.2-14 1.2-2.7c.2-.5.8-.9 1.4-.9.6 0 1.1.4 1.4.9l.6 1.5 6.7 15.2c.4.8.1 1.7-.7 2zM18.2 30.4c-.2.1-.4.1-.6.1-.6 0-1.1-.3-1.4-.9l-6-13.6-6 13.6c-.3.8-1.2 1.1-2 .8-.8-.3-1.1-1.2-.8-2l6.2-13.9 1.2-2.8c.2-.6.8-.9 1.4-.9.6 0 1.1.3 1.4.9l.7 1.5L19 28.4c.3.7 0 1.6-.8 2z'
            fill='#40f1ff'
          ></path>
          <path
            d='M47.3 21.1c-.8 4.5-4.8 8.9-9.5 8.9s-8.7-4.4-9.5-8.9h19zM19.7 28.3c-.9 4.5-4.8 8.9-9.5 8.9S1.5 32.8.7 28.3h19z'
            fill='#40f1ff'
          ></path>
          <path
            d='m11.6 11.7.7 1.5-4.7 1.2 1.2-2.8c.2-.6.8-.9 1.4-.9.6.1 1.1.4 1.4 1zM39.8 6l-4.6 1.2 1.2-2.7c.2-.5.8-.9 1.4-.9.6 0 1.1.4 1.4.9l.6 1.5z'
            fill='#40f1ff'
          ></path>
          <path
            d='M41.8 3.4 31.4 6.2 17.7 9.7 6.9 12.6c-.8.2-1.6-.3-1.8-1.1s.3-1.6 1.1-1.8l10.5-2.8 14.2-3.7L41.1.5c.8-.2 1.6.3 1.8 1.1.2.8-.3 1.6-1.1 1.8z'
            fill='#40f1ff'
          ></path>
          <path
            d='M25.5 5.9v38.4c0 .8-.7 1.5-1.5 1.5s-1.5-.7-1.5-1.5V5.9c0-.8.7-1.5 1.5-1.5s1.5.7 1.5 1.5z'
            fill='#40f1ff'
          ></path>
          <path d='M31.4 5.9v.3L17.7 9.7c-.5-.9-.9-1.8-1-2.8l14.2-3.7c.3.8.5 1.7.5 2.7z' fill='#40f1ff'></path>
          <path
            d='M25.5 5.9v7.3c-.5.1-1 .2-1.5.2s-1 0-1.5-.2V5.9c0-.8.7-1.5 1.5-1.5s1.5.7 1.5 1.5z'
            fill='#40f1ff'
          ></path>
          <circle cx='24' cy='5.9' fill='#40f1ff' r='5.4'></circle>
          <circle cx='24' cy='5.9' fill='#40f1ff' r='2.9'></circle>
          <path d='M10.4 44.5v3h27.3v-3c0-1.5-1.2-2.7-2.7-2.7H13c-1.4 0-2.6 1.2-2.6 2.7z' fill='#40f1ff'></path>
          <path
            d='M47.5 21.1c0 5.4-4.3 9.7-9.7 9.7-5.4 0-9.7-4.3-9.7-9.7h.2c.9 4.5 4.8 7.9 9.5 7.9s8.7-3.4 9.5-7.9h.2zM19.9 28.3c0 5.4-4.4 9.7-9.7 9.7S.5 33.7.5 28.3h.2c.9 4.5 4.8 7.9 9.5 7.9s8.7-3.4 9.5-7.9h.2z'
            fill='#40f1ff'
          ></path>
        </svg>
      </Grid>
      <Typography fontSize={'10px'} fontWeight={400} sx={{ mt: 2 }} color={'white'}>
        coming soon
      </Typography>
    </>
  )
}

export const RegenerateIcon = () => {
  return (
    <>
      <Grid item width={20}>
        <svg
          viewBox='0 0 16 16'
          xmlns='http://www.w3.org/2000/svg'
          fill-rule='evenodd'
          clip-rule='evenodd'
          stroke-linejoin='round'
          stroke-miterlimit='2'
        >
          <path
            d='M7.836 1.75A6.253 6.253 0 0 0 1.586 8a6.242 6.242 0 0 0 2.657 5.113.75.75 0 1 0 .863-1.226 4.752 4.752 0 0 1 2.73-8.637.75.75 0 0 0 0-1.5ZM8.238 14.237A6.254 6.254 0 0 0 14.086 8a6.24 6.24 0 0 0-2.199-4.758.75.75 0 0 0-.973 1.142A4.737 4.737 0 0 1 12.586 8a4.753 4.753 0 0 1-4.444 4.74.75.75 0 0 0 .096 1.497Z'
            fill='#40f1ff'
          ></path>
          <path
            d='M13.664 2.75h-2.828a.75.75 0 0 0-.75.75v2.828a.75.75 0 0 0 1.5 0V4.25h2.078a.75.75 0 0 0 0-1.5ZM2.336 13.75h2.828a.75.75 0 0 0 .75-.75v-2.828a.75.75 0 0 0-1.5 0v2.078H2.336a.75.75 0 0 0 0 1.5Z'
            fill='#40f1ff'
          ></path>
        </svg>
      </Grid>
      <Typography fontSize={'10px'} fontWeight={400} sx={{ mt: 2 }} color={'white'}>
        再生成
      </Typography>
    </>
  )
}

export const EditIcon = () => {
  return (
    <>
      <Grid item width={20}>
        <svg data-name='Layer 1' viewBox='0 0 24 24' xmlns='http://www.w3.org/2000/svg'>
          <path
            d='M3 24h14a3 3 0 0 0 3-3v-7.52a1 1 0 0 0-2 0V21a1 1 0 0 1-1 1H3a1 1 0 0 1-1-1V6a1 1 0 0 1 1-1h8.52a1 1 0 0 0 0-2H3a3 3 0 0 0-3 3v15a3 3 0 0 0 3 3Z'
            fill='#40f1ff'
          ></path>
          <path
            d='M21.076.011a2.567 2.567 0 0 0-2.049.721L10.1 9.655a.993.993 0 0 0-.286.589l-.381 3.209a1 1 0 0 0 .993 1.118.945.945 0 0 0 .118-.007l3.209-.381a.993.993 0 0 0 .589-.286l8.923-8.922a2.579 2.579 0 0 0 .721-2.05A3.18 3.18 0 0 0 23.051.95a3.18 3.18 0 0 0-1.975-.939Zm.779 3.549-8.678 8.678-1.605.19.191-1.6 8.679-8.678c.325-.329.923-.058 1.194.21s.55.869.219 1.2Z'
            fill='#40f1ff'
          ></path>
        </svg>
      </Grid>
      <Typography fontSize={'10px'} fontWeight={400} sx={{ mt: 2 }} color={'white'}>
        編集
      </Typography>
    </>
  )
}

export const CollectionsBookmarkOutlinedIcon = () => {
  return (
    <>
      <Grid item width={20}>
        <svg data-name='Layer 1' viewBox='0 0 24 24' xmlns='http://www.w3.org/2000/svg'>
          <path
            d='M3 24h14a3 3 0 0 0 3-3v-7.52a1 1 0 0 0-2 0V21a1 1 0 0 1-1 1H3a1 1 0 0 1-1-1V6a1 1 0 0 1 1-1h8.52a1 1 0 0 0 0-2H3a3 3 0 0 0-3 3v15a3 3 0 0 0 3 3Z'
            fill='#40f1ff'
          ></path>
          <path
            d='M21.076.011a2.567 2.567 0 0 0-2.049.721L10.1 9.655a.993.993 0 0 0-.286.589l-.381 3.209a1 1 0 0 0 .993 1.118.945.945 0 0 0 .118-.007l3.209-.381a.993.993 0 0 0 .589-.286l8.923-8.922a2.579 2.579 0 0 0 .721-2.05A3.18 3.18 0 0 0 23.051.95a3.18 3.18 0 0 0-1.975-.939Zm.779 3.549-8.678 8.678-1.605.19.191-1.6 8.679-8.678c.325-.329.923-.058 1.194.21s.55.869.219 1.2Z'
            fill='#40f1ff'
          ></path>
        </svg>
      </Grid>
      <Typography fontSize={'10px'} fontWeight={400} sx={{ mt: 2 }} color={'white'}>
      マスク&タグ
      </Typography>
    </>
  )
}
